[
    {
        "id": 1,
        "projectPath": "/OC-P12/projet11.jpg",
        "title": "Argent Bank",
        "description": "I created the interface of a banking application with React. I also implemented an authentication system with an API and implemented Redux to manage application state.",
        "descriptionFR": "J'ai créé l'interface d'une application bancaire avec React. J'ai également implémenté un système d'authentification avec une API et implémenté Redux pour gérer l'état de l'application.",
        "repository": "https://github.com/christopher-cornet/OC-P11",
        "website": "",
        "alt": "Projet 11 Argent Bank",
        "technologies": ["React", "CSS", "Redux", "Swagger"]
    },
    {
        "id": 2,
        "projectPath": "/OC-P12/projet10.jpg",
        "title": "724 Events",
        "description": "I fixed errors on an event agency's website using tests. I designed a recipe book in order to have a list of test scenarios to carry out in order to confirm that all the expected functionalities are operational.",
        "descriptionFR": "J'ai corrigé des erreurs sur le site d'une agence événementielle à l'aide de tests. J'ai conçu un livre de recettes afin d'avoir une liste de scénarios de tests à réaliser afin de confirmer que toutes les fonctionnalités attendues sont opérationnelles.",
        "repository": "https://github.com/christopher-cornet/OC-P10",
        "website": "",
        "alt": "Projet 10 724 Events",
        "technologies": ["React", "SCSS"]
    },
    {
        "id": 3,
        "projectPath": "/OC-P12/projet8.jpg",
        "title": "Kasa",
        "description": "I created a real estate rental web application with React. I used React Router to manage the routes of the different pages. I also took into account the handling of route errors which redirect to the 404 error page.",
        "descriptionFR": "J'ai créé une application web de location immobilière avec React. J'ai utilisé React Router pour gérer les routes des différentes pages. J'ai également pris en compte la gestion des erreurs de route qui redirigent vers la page d'erreur 404.",
        "repository": "https://github.com/christopher-cornet/oc-kasa",
        "website": "",
        "alt": "Projet 8 Kasa",
        "technologies": ["React", "SCSS"]
    },
    {
        "id": 4,
        "projectPath": "/OC-P12/projet6.jpg",
        "title": "Portfolio d'architecte",
        "description": "I created an interior designer portfolio. I used the APIs to create an authentication system, add projects and delete projects. The user can add projects without reloading the page, because the DOM is updated.",
        "descriptionFR": "J'ai créé un portfolio d'architecte d'intérieur. J'ai utilisé les APIs pour créer un système d'authentification, ajouter des projets et supprimer des projets. L'utilisateur peut ajouter des projets sans recharger la page, car le DOM est mis à jour.",
        "repository": "https://github.com/christopher-cornet/oc-portfolio-architecte",
        "website": "",
        "alt": "Projet Portfolio d'architecte",
        "technologies": ["HTML", "CSS", "Javascript", "Swagger"]
    },
    {
        "id": 5,
        "projectPath": "/OC-P12/projet5.jpg",
        "title": "Print It",
        "description": "I created a dynamic and fluid carousel with Javascript. I used event listeners, bullet points that let the user know which slide they are on. The carousel also includes infinite scrolling managed with conditions.",
        "descriptionFR": "J'ai créé un carrousel dynamique et fluide avec Javascript. J'ai utilisé des écouteurs d'événements, des bullet points qui permettent à l'utilisateur de savoir sur quelle diapositive il se trouve. Le carrousel comprend également un défilement infini géré avec des conditions.",
        "repository": "https://github.com/christopher-cornet/print-it",
        "website": "https://christopher-cornet.github.io/print-it/",
        "alt": "Projet Print It",
        "technologies": ["HTML", "CSS", "Javascript"]
    },
    {
        "id": 6,
        "projectPath": "/OC-P12/projet4.jpg",
        "title": "Oh My Food",
        "description": "I developed a site that lists the menus of gourmet restaurants. I initially integrated all the pages of the mobile site using models, so the site is responsive. I created some animations with SCSS and the code is as expected.",
        "descriptionFR": "J'ai développé un site qui répertorie les menus des restaurants gastronomiques. J'ai intégré toutes les pages du site mobile dans un premier temps à l'aide des maquettes, le site est donc responsive. J'ai créé des animations avec SCSS et le code est comme prévu.",
        "repository": "https://github.com/christopher-cornet/ohmyfood",
        "website": "https://christopher-cornet.github.io/ohmyfood/",
        "alt": "Projet Oh My Food",
        "technologies": ["HTML", "CSS", "SCSS"]
    }
]